#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-jNtgCFYFfccpprkY

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.my_instance_dns will be created
  + resource "cloudflare_record" "my_instance_dns" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (known after apply)
    }

  # cloudflare_zone.my_zone will be created
  + resource "cloudflare_zone" "my_zone" {
      + account_id          = "f70da044f5173ed20235520ad4bd1881"
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "wisdomdemo.com"
    }

  # google_compute_firewall.allow_http will be created
  + resource "google_compute_firewall" "allow_http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-http"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "staging-pr-demo",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allow_https will be created
  + resource "google_compute_firewall" "allow_https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-https"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "staging-pr-demo",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.staging_pr_demo will be created
  + resource "google_compute_instance" "staging_pr_demo" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata             = {
          + "ssh-keys"       = "stoxmod:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDTJ2ENauVFvyeqs5V14CoR3pfgXkGQtr/uBWBes0fXhIuJOBWPuGEFbXBxOw5G2lGxh8wvZzG76yGlMYqmXREzjdquAMzOSFmMfy1/ydM7bYWFFcyEVEqr7T7TZ4S67tJOSNltXHOOwfSfdCygCCcNQPT9sNVIjj+cmhOya7Te5lITjgpFqfb/fn8yqd/Y5F2psKEUJVNmzBd+f0Sd83SpHFRUgXLTsZ0A++n/z0plHzKst6LRnJycp3DQPDtlPxqCN11e5D7bjpGgQqDwALoK5LlNVBc61fVVHae/B+VYrR9hCvzHj3MgtuZosCJMH5NCeq7UNAyTyG/y0rOn/BWF stoxmod"
          + "startup-script" = <<-EOT
                #!/bin/bash
                set -e
                
                # Install dependencies
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -o Dpkg::Options::="--force-confdef" -o Dpkg::Options::="--force-confold" dist-upgrade
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq update
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq install curl wget git vim apt-transport-https ca-certificates nginx
                
                # Setup NodeJS 16.x
                curl -sL https://deb.nodesource.com/setup_16.x | sudo -E bash -
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq install nodejs
                sudo npm install pm2@latest -g
                
                # Setup sudo to allow no-password sudo for "metaroon" group and adding "stoxmod" user
                sudo groupadd -r metaroon
                sudo useradd -m -s /bin/bash stoxmod
                sudo usermod -a -G metaroon stoxmod
                sudo cp /etc/sudoers /etc/sudoers.orig
                echo "stoxmod ALL=(ALL) NOPASSWD:ALL" | sudo tee /etc/sudoers.d/stoxmod
                
                # Change deployment directory path and permissions
                sudo mkdir -p /var/app
                sudo chown -R stoxmod:stoxmod /var/app
                
                # Setup nginx
                # Remove the default configuration
                sudo sh -c '> /etc/nginx/sites-available/default' && \
                sudo sh -c 'sudo cat <<EOF > /etc/nginx/sites-available/default
                upstream app_upstream {
                server 127.0.0.1:5000;
                keepalive 64;
                }
                
                server {
                listen 80 default_server;
                listen [::]:80 default_server;
                server_name _;
                
                location / {
                proxy_set_header X-Forwarded-For \$proxy_add_x_forwarded_for;
                proxy_set_header X-Real-IP \$remote_addr;
                proxy_set_header Host \$http_host;
                
                proxy_http_version 1.1;
                proxy_set_header Upgrade \$http_upgrade;
                proxy_set_header Connection "upgrade";
                
                proxy_pass http://localhost:5000;
                proxy_redirect off;
                proxy_read_timeout 240s;
                }
                }
                EOF'
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = (known after apply)
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "staging-pr-demo",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-minimal-2204-jammy-v20231101"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # google_compute_project_metadata.ssh_keys will be created
  + resource "google_compute_project_metadata" "ssh_keys" {
      + id       = (known after apply)
      + metadata = {
          + "ssh-keys" = "stoxmod:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDTJ2ENauVFvyeqs5V14CoR3pfgXkGQtr/uBWBes0fXhIuJOBWPuGEFbXBxOw5G2lGxh8wvZzG76yGlMYqmXREzjdquAMzOSFmMfy1/ydM7bYWFFcyEVEqr7T7TZ4S67tJOSNltXHOOwfSfdCygCCcNQPT9sNVIjj+cmhOya7Te5lITjgpFqfb/fn8yqd/Y5F2psKEUJVNmzBd+f0Sd83SpHFRUgXLTsZ0A++n/z0plHzKst6LRnJycp3DQPDtlPxqCN11e5D7bjpGgQqDwALoK5LlNVBc61fVVHae/B+VYrR9hCvzHj3MgtuZosCJMH5NCeq7UNAyTyG/y0rOn/BWF stoxmod"
        }
      + project  = (known after apply)
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*